torbrodtkorb/alva-master/firmware/pack/edc/AVR32DB48.PIC
        <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL7" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x217">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="CHANNEL7" edc:nzwidth="0x8" edc:desc="Channel 7 generator select">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="UPDI_SYNCH" edc:desc="UPDI SYNCH character" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="MVIO" edc:desc="MVIO VDDIO2 OK" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="RTC_OVF" edc:desc="Real Time Counter overflow" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="RTC_CMP" edc:desc="Real Time Counter compare" edc:when="(field &amp; 0xFF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV512" edc:desc="Periodic Interrupt Timer output 0" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV256" edc:desc="Periodic Interrupt Timer output 1" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV128" edc:desc="Periodic Interrupt Timer output 2" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV64" edc:desc="Periodic Interrupt Timer output 3" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT0" edc:desc="Configurable Custom Logic LUT0" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT1" edc:desc="Configurable Custom Logic LUT1" edc:when="(field &amp; 0xFF) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT2" edc:desc="Configurable Custom Logic LUT2" edc:when="(field &amp; 0xFF) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT3" edc:desc="Configurable Custom Logic LUT3" edc:when="(field &amp; 0xFF) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT4" edc:desc="Configurable Custom Logic LUT4" edc:when="(field &amp; 0xFF) == 0x14"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT5" edc:desc="Configurable Custom Logic LUT5" edc:when="(field &amp; 0xFF) == 0x15"/>
                <edc:SFRFieldSemantic edc:cname="AC0_OUT" edc:desc="Analog Comparator 0 out" edc:when="(field &amp; 0xFF) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="AC1_OUT" edc:desc="Analog Comparator 1 out" edc:when="(field &amp; 0xFF) == 0x21"/>
                <edc:SFRFieldSemantic edc:cname="AC2_OUT" edc:desc="Analog Comparator 2 out" edc:when="(field &amp; 0xFF) == 0x22"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_RESRDY" edc:desc="ADC 0 Result Ready" edc:when="(field &amp; 0xFF) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="ZCD0" edc:desc="Zero Cross Detect 0 out" edc:when="(field &amp; 0xFF) == 0x30"/>
                <edc:SFRFieldSemantic edc:cname="ZCD1" edc:desc="Zero Cross Detect 1 out" edc:when="(field &amp; 0xFF) == 0x31"/>
                <edc:SFRFieldSemantic edc:cname="ZCD2" edc:desc="Zero Cross Detect 2 out" edc:when="(field &amp; 0xFF) == 0x32"/>
                <edc:SFRFieldSemantic edc:cname="OPAMP0_READY" edc:desc="OPAMP0 Ready" edc:when="(field &amp; 0xFF) == 0x34"/>
                <edc:SFRFieldSemantic edc:cname="OPAMP1_READY" edc:desc="OPAMP1 Ready" edc:when="(field &amp; 0xFF) == 0x35"/>
                <edc:SFRFieldSemantic edc:cname="OPAMP2_READY" edc:desc="OPAMP2 Ready" edc:when="(field &amp; 0xFF) == 0x36"/>
                <edc:SFRFieldSemantic edc:cname="USART0_XCK" edc:desc="USART 0 XCK" edc:when="(field &amp; 0xFF) == 0x60"/>
                <edc:SFRFieldSemantic edc:cname="USART1_XCK" edc:desc="USART 1 XCK" edc:when="(field &amp; 0xFF) == 0x61"/>
                <edc:SFRFieldSemantic edc:cname="USART2_XCK" edc:desc="USART 2 XCK" edc:when="(field &amp; 0xFF) == 0x62"/>
                <edc:SFRFieldSemantic edc:cname="USART3_XCK" edc:desc="USART 3 XCK" edc:when="(field &amp; 0xFF) == 0x63"/>
                <edc:SFRFieldSemantic edc:cname="USART4_XCK" edc:desc="USART 4 XCK" edc:when="(field &amp; 0xFF) == 0x64"/>
                <edc:SFRFieldSemantic edc:cname="SPI0_SCK" edc:desc="SPI 0 SCK" edc:when="(field &amp; 0xFF) == 0x68"/>
                <edc:SFRFieldSemantic edc:cname="SPI1_SCK" edc:desc="SPI 1 SCK" edc:when="(field &amp; 0xFF) == 0x69"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow / low byte timer underflow" edc:when="(field &amp; 0xFF) == 0x80"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 high byte timer underflow" edc:when="(field &amp; 0xFF) == 0x81"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0_LCMP0" edc:desc="Timer/Counter A0 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x84"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1_LCMP1" edc:desc="Timer/Counter A0 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x85"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2_LCMP2" edc:desc="Timer/Counter A0 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x86"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_OVF_LUNF" edc:desc="Timer/Counter A1 overflow / low byte timer underflow" edc:when="(field &amp; 0xFF) == 0x88"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_HUNF" edc:desc="Timer/Counter A1 high byte timer underflow" edc:when="(field &amp; 0xFF) == 0x89"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_CMP0_LCMP0" edc:desc="Timer/Counter A1 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x8C"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_CMP1_LCMP1" edc:desc="Timer/Counter A1 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x8D"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_CMP2_LCMP2" edc:desc="Timer/Counter A1 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x8E"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_CAPT" edc:desc="Timer/Counter B0 capture" edc:when="(field &amp; 0xFF) == 0xA0"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_OVF" edc:desc="Timer/Counter B0 overflow" edc:when="(field &amp; 0xFF) == 0xA1"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_CAPT" edc:desc="Timer/Counter B1 capture" edc:when="(field &amp; 0xFF) == 0xA2"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_OVF" edc:desc="Timer/Counter B1 overflow" edc:when="(field &amp; 0xFF) == 0xA3"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_CAPT" edc:desc="Timer/Counter B2 capture" edc:when="(field &amp; 0xFF) == 0xA4"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_OVF" edc:desc="Timer/Counter B2 overflow" edc:when="(field &amp; 0xFF) == 0xA5"/>
                <edc:SFRFieldSemantic edc:cname="TCB3_CAPT" edc:desc="Timer/Counter B3 capture" edc:when="(field &amp; 0xFF) == 0xA6"/>
                <edc:SFRFieldSemantic edc:cname="TCB3_OVF" edc:desc="Timer/Counter B3 overflow" edc:when="(field &amp; 0xFF) == 0xA7"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBCLR" edc:desc="Timer/Counter D0 event 0" edc:when="(field &amp; 0xFF) == 0xB0"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPASET" edc:desc="Timer/Counter D0 event 1" edc:when="(field &amp; 0xFF) == 0xB1"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBSET" edc:desc="Timer/Counter D0 event 2" edc:when="(field &amp; 0xFF) == 0xB2"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_PROGEV" edc:desc="Timer/Counter D0 event 3" edc:when="(field &amp; 0xFF) == 0xB3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL8" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x218">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="CHANNEL8" edc:nzwidth="0x8" edc:desc="Channel 8 generator select">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="UPDI_SYNCH" edc:desc="UPDI SYNCH character" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="MVIO" edc:desc="MVIO VDDIO2 OK" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="RTC_OVF" edc:desc="Real Time Counter overflow" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="RTC_CMP" edc:desc="Real Time Counter compare" edc:when="(field &amp; 0xFF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV8192" edc:desc="Periodic Interrupt Timer output 0" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV4096" edc:desc="Periodic Interrupt Timer output 1" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV2048" edc:desc="Periodic Interrupt Timer output 2" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV1024" edc:desc="Periodic Interrupt Timer output 3" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT0" edc:desc="Configurable Custom Logic LUT0" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT1" edc:desc="Configurable Custom Logic LUT1" edc:when="(field &amp; 0xFF) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT2" edc:desc="Configurable Custom Logic LUT2" edc:when="(field &amp; 0xFF) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT3" edc:desc="Configurable Custom Logic LUT3" edc:when="(field &amp; 0xFF) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT4" edc:desc="Configurable Custom Logic LUT4" edc:when="(field &amp; 0xFF) == 0x14"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT5" edc:desc="Configurable Custom Logic LUT5" edc:when="(field &amp; 0xFF) == 0x15"/>
                <edc:SFRFieldSemantic edc:cname="AC0_OUT" edc:desc="Analog Comparator 0 out" edc:when="(field &amp; 0xFF) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="AC1_OUT" edc:desc="Analog Comparator 1 out" edc:when="(field &amp; 0xFF) == 0x21"/>
                <edc:SFRFieldSemantic edc:cname="AC2_OUT" edc:desc="Analog Comparator 2 out" edc:when="(field &amp; 0xFF) == 0x22"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_RESRDY" edc:desc="ADC 0 Result Ready" edc:when="(field &amp; 0xFF) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="ZCD0" edc:desc="Zero Cross Detect 0 out" edc:when="(field &amp; 0xFF) == 0x30"/>
                <edc:SFRFieldSemantic edc:cname="ZCD1" edc:desc="Zero Cross Detect 1 out" edc:when="(field &amp; 0xFF) == 0x31"/>
                <edc:SFRFieldSemantic edc:cname="ZCD2" edc:desc="Zero Cross Detect 2 out" edc:when="(field &amp; 0xFF) == 0x32"/>
                <edc:SFRFieldSemantic edc:cname="OPAMP0_READY" edc:desc="OPAMP0 Ready" edc:when="(field &amp; 0xFF) == 0x34"/>
                <edc:SFRFieldSemantic edc:cname="OPAMP1_READY" edc:desc="OPAMP1 Ready" edc:when="(field &amp; 0xFF) == 0x35"/>
                <edc:SFRFieldSemantic edc:cname="OPAMP2_READY" edc:desc="OPAMP2 Ready" edc:when="(field &amp; 0xFF) == 0x36"/>
                <edc:SFRFieldSemantic edc:cname="USART0_XCK" edc:desc="USART 0 XCK" edc:when="(field &amp; 0xFF) == 0x60"/>
                <edc:SFRFieldSemantic edc:cname="USART1_XCK" edc:desc="USART 1 XCK" edc:when="(field &amp; 0xFF) == 0x61"/>
                <edc:SFRFieldSemantic edc:cname="USART2_XCK" edc:desc="USART 2 XCK" edc:when="(field &amp; 0xFF) == 0x62"/>
                <edc:SFRFieldSemantic edc:cname="USART3_XCK" edc:desc="USART 3 XCK" edc:when="(field &amp; 0xFF) == 0x63"/>
                <edc:SFRFieldSemantic edc:cname="USART4_XCK" edc:desc="USART 4 XCK" edc:when="(field &amp; 0xFF) == 0x64"/>
                <edc:SFRFieldSemantic edc:cname="SPI0_SCK" edc:desc="SPI 0 SCK" edc:when="(field &amp; 0xFF) == 0x68"/>
                <edc:SFRFieldSemantic edc:cname="SPI1_SCK" edc:desc="SPI 1 SCK" edc:when="(field &amp; 0xFF) == 0x69"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow / low byte timer underflow" edc:when="(field &amp; 0xFF) == 0x80"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 high byte timer underflow" edc:when="(field &amp; 0xFF) == 0x81"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0_LCMP0" edc:desc="Timer/Counter A0 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x84"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1_LCMP1" edc:desc="Timer/Counter A0 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x85"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2_LCMP2" edc:desc="Timer/Counter A0 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x86"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_OVF_LUNF" edc:desc="Timer/Counter A1 overflow / low byte timer underflow" edc:when="(field &amp; 0xFF) == 0x88"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_HUNF" edc:desc="Timer/Counter A1 high byte timer underflow" edc:when="(field &amp; 0xFF) == 0x89"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_CMP0_LCMP0" edc:desc="Timer/Counter A1 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x8C"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_CMP1_LCMP1" edc:desc="Timer/Counter A1 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x8D"/>
                <edc:SFRFieldSemantic edc:cname="TCA1_CMP2_LCMP2" edc:desc="Timer/Counter A1 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x8E"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_CAPT" edc:desc="Timer/Counter B0 capture" edc:when="(field &amp; 0xFF) == 0xA0"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_OVF" edc:desc="Timer/Counter B0 overflow" edc:when="(field &amp; 0xFF) == 0xA1"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_CAPT" edc:desc="Timer/Counter B1 capture" edc:when="(field &amp; 0xFF) == 0xA2"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_OVF" edc:desc="Timer/Counter B1 overflow" edc:when="(field &amp; 0xFF) == 0xA3"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_CAPT" edc:desc="Timer/Counter B2 capture" edc:when="(field &amp; 0xFF) == 0xA4"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_OVF" edc:desc="Timer/Counter B2 overflow" edc:when="(field &amp; 0xFF) == 0xA5"/>
                <edc:SFRFieldSemantic edc:cname="TCB3_CAPT" edc:desc="Timer/Counter B3 capture" edc:when="(field &amp; 0xFF) == 0xA6"/>
                <edc:SFRFieldSemantic edc:cname="TCB3_OVF" edc:desc="Timer/Counter B3 overflow" edc:when="(field &amp; 0xFF) == 0xA7"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBCLR" edc:desc="Timer/Counter D0 event 0" edc:when="(field &amp; 0xFF) == 0xB0"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPASET" edc:desc="Timer/Counter D0 event 1" edc:when="(field &amp; 0xFF) == 0xB1"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBSET" edc:desc="Timer/Counter D0 event 2" edc:when="(field &amp; 0xFF) == 0xB2"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_PROGEV" edc:desc="Timer/Counter D0 event 3" edc:when="(field &amp; 0xFF) == 0xB3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
